# Quick Statistics Using DataFrame functionality

#### df.describe()
- The .describe() method prints the summary statistics of all numeric columns.
- Count, Mean, Standard Deviation, Range, and quartiles of numeric columns.

In [3]:
import pandas as pd
import csv

# Importing CSV dataset
df = pd.read_csv("studentsperformance.csv")

In [4]:
df.describe()

              age  maths_score  reading_score  writing_score
count  999.000000   1000.00000    1000.000000    1000.000000
mean    24.030030     66.08900      69.169000      68.054000
std      3.648798     15.16308      14.600192      15.195657
min     18.000000      0.00000      17.000000      10.000000
25%     21.000000     57.00000      59.000000      57.750000
50%     24.000000     66.00000      70.000000      69.000000
75%     27.000000     77.00000      79.000000      79.000000
max     30.000000    100.00000     100.000000     100.000000

- To isolate specific data types in your summary output(.describe) by using the include argument. Here, for example, weâ€™re only summarizing the columns with the integer data type.

In [5]:
df.describe(include=[int])

       maths_score  reading_score  writing_score
count   1000.00000    1000.000000    1000.000000
mean      66.08900      69.169000      68.054000
std       15.16308      14.600192      15.195657
min        0.00000      17.000000      10.000000
25%       57.00000      59.000000      57.750000
50%       66.00000      70.000000      69.000000
75%       77.00000      79.000000      79.000000
max      100.00000     100.000000     100.000000

- Similarly, you might want to exclude certain data types using exclude argument.

In [6]:
df.describe(exclude=[int])

,gender,age,parental_level_of_education,lunch,test_preparation_course
count,1000,999.000000,1000,1000,1000
unique,2,NaN,6,2,2
top,female,NaN,some college,standard,none
freq,518,NaN,226,645,642
mean,NaN,24.030030,NaN,NaN,NaN
std,NaN,3.648798,NaN,NaN,NaN
min,NaN,18.000000,NaN,NaN,NaN
25%,NaN,21.000000,NaN,NaN,NaN
50%,NaN,24.000000,NaN,NaN,NaN
75%,NaN,27.000000,NaN,NaN,NaN
max,NaN,30.000000,NaN,NaN,NaN

#### .info()
- The .info() method is a quick way to look at the data types, missing values, and data size of a DataFrame.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   age                          999 non-null    float64
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   maths_score                  1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: float64(1), int64(3), object(4)
memory usage: 62.6+ KB

#### df.min(), df.max() etc....

In [8]:
#Simply getting max() output:
df.maths_score.max()

np.int64(100)

In [9]:
#With entier dataframe max() output:
df[(df.maths_score==df.maths_score.max())]

,gender,age,parental_level_of_education,lunch,test_preparation_course,maths_score,reading_score,writing_score
149,male,18.0,associate's degree,free/reduced,completed,100,100,93
451,female,20.0,some college,standard,none,100,92,97
458,female,28.0,bachelor's degree,standard,none,100,100,100
623,male,30.0,some college,standard,completed,100,96,86
625,male,29.0,some college,standard,completed,100,97,99
916,male,24.0,bachelor's degree,standard,completed,100,100,100
962,female,30.0,associate's degree,standard,none,100,100,100

In [10]:
#Simply getting max() output:
df.maths_score.min()

np.int64(0)

In [11]:
#With entier dataframe min() output:
df[(df.maths_score==df.maths_score.min())]

,gender,age,parental_level_of_education,lunch,test_preparation_course,maths_score,reading_score,writing_score
59,female,26.0,some high school,free/reduced,none,0,17,10

In [12]:
#Printing Max() and Min() Together:
df[(df.maths_score==df.maths_score.max()) | (df.maths_score==df.maths_score.min())]

,gender,age,parental_level_of_education,lunch,test_preparation_course,maths_score,reading_score,writing_score
59,female,26.0,some high school,free/reduced,none,0,17,10
149,male,18.0,associate's degree,free/reduced,completed,100,100,93
451,female,20.0,some college,standard,none,100,92,97
458,female,28.0,bachelor's degree,standard,none,100,100,100
623,male,30.0,some college,standard,completed,100,96,86
625,male,29.0,some college,standard,completed,100,97,99
916,male,24.0,bachelor's degree,standard,completed,100,100,100
962,female,30.0,associate's degree,standard,none,100,100,100